d2025/matematiks.tex
% Created 2025-05-04 Sun 13:00
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{mathptmx}  % Times font
\usepackage{helvet}   % Helvetica font
\renewcommand{\familydefault}{\sfdefault} % Sans-serif as default
\usepackage{titlesec}
\usepackage{lmodern}
\author{Serob Tigranyan}
\date{\today}
\title{Mathematical Analysis}
\hypersetup{
 pdfauthor={Serob Tigranyan},
 pdftitle={Mathematical Analysis},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\newpage
\section{Analsys of the function}
\label{sec:org578098d}
We're given the function:
\[
f(x) = \frac{x^2+3x-1}{3-2x}
\]

And we need to analyse and graph the function by following the steps below:
\begin{enumerate}
\item Domain of the Function
\item Limit at the Domain's Edges
\item Interceptions at \(X\) and \(Y\) axies
\item Monotonic Intervals
\item Critical Points and Local Extrema
\item Function values at Extrema
\item Concavity and Inflection Points
\item Asymptotes
\item Graphing the Function
\end{enumerate}
\section{Domain of the function}
\label{sec:org5cf4103}
Since we have fractional function, the domain of the function is all real numbers except when the denominator is zero:
\[
3-2x \neq 0 \rightarrow x \neq \frac{3}{2}
\]
\section{Limit at the Domain's Edges}
\label{sec:org09346df}
\section{Interceptions at X and Y axies}
\label{sec:orgfff794d}
\section{Monotonic Intervals}
\label{sec:org15b867c}
\section{Critical Points and Local Extrema}
\label{sec:org6535a98}
\section{Concavity and Inflection Points}
\label{sec:orgbfcf72c}
\section{Asymptotes}
\label{sec:orgd6a4e38}
\section{Graphing the Function}
\label{sec:orgc08c607}
\end{document}
